[
	[
		"Манастырная Татьяна|109|2013-11-25|2014-01-10",
		"Смирнов Владимир|107|2013-11-25|2014-01-10"
	],
	[
		[
			"2013-12-09",
			"2013-12-16"
		],
		[
			"2013-12-02"
		]
	],
	[
		[
			200",
			"100"
		],
		[
			"400"
		]
	]
]

как видно из картинки - у меня есть вот такая структура, из которой видно что Монастырной тане отвечают даты "2013-12-09","2013-12-16" и проплаты 200 и 100 грн, так же и с Владимиром, но вот когда мне нужно что бы фамилии шли по порядку я меняю массив фамилий, и остальные же массивы не меняются и соответствия дат и проплат относительно фамилии теряется. Можно ли это как то решить в данном массиве или нужно изнчально формировать массив по другому, к примеру, выстроенным как нужно?